In [1]:
import pandas as pd

In [2]:
#load dataset
df = pd.read_csv(r'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
#filter column names
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
#count of the colums
len(df.columns)

12

In [6]:
#data types of the columns
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
#findout missing values
df.isnull().count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          891
Embarked       891
dtype: int64

In [8]:
#filtering required columns
df[['Age','PassengerId']]

      Age  PassengerId
0    22.0            1
1    38.0            2
2    26.0            3
3    35.0            4
4    35.0            5
..    ...          ...
886  27.0          887
887  19.0          888
888   NaN          889
889  26.0          890
890  32.0          891

[891 rows x 2 columns]

In [9]:
#best way to filter categorical columns
categorical_features = [feature for feature in df.columns if df[feature].dtype == 'object']
print('we have {} categorical features ; {}'.format(len(categorical_features), categorical_features))

we have 5 categorical features ; ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [10]:
#best way to find numerical columns
numerical_columns = [i for i in df.columns if df[i].dtypes!='object']
print('we have {} numerical columns:{}'.format(len(numerical_columns), numerical_columns))

we have 7 numerical columns:['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [11]:
#description of data (for categorical columns)
df[[i for i in df.columns if df[i].dtypes=='object']].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [12]:
#description of data (only for numerical data)
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [14]:
#find out who paid maximum
df[df['Fare']==max(df['Fare'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

# Findout howmany male and female passengers onboarded

In [15]:
#method -1 using value_counts()
df['Sex'].value_counts()     #value_counts() is for groubby operation

male      577
female    314
Name: Sex, dtype: int64

In [19]:
#method -2 using groupby operation
df.groupby('Sex').count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

In [25]:
#method -3 filter operation
len(df[df['Sex']=='male'])
len(df[df['Sex']=='female'])

314

# How many survived we have

In [27]:
#method 1
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [29]:
#method 2
len(df[df['Survived']==1])

342

In [32]:
#method 3
df.groupby('Survived')['Survived'].count()

Survived
0    549
1    342
Name: Survived, dtype: int64

# How many casualty we have

In [33]:
len(df[df['Survived']==0])

549

# what is the name of eldest person

In [34]:
#method 1
df[df['Age']==max(df['Age'])]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

In [40]:
#method 2
df[df['Age']==df['Age'].max()]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

# How many passengers we have class

In [41]:
#method 1
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [44]:
#method 2
df.groupby('Pclass')['Pclass'].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

# how many person we have whose name starts with "s"

In [45]:
df[df['Name'].str.startswith('S',na=False)]['Name'].count()

86

# create a new column which is summation of SibSp&Parch

In [46]:
df['New'] = df['SibSp']+df['Parch']
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

# below age 25

In [47]:
df[df['Age']<25]['Age'].count()

278

# how many person died whose age below 40

In [48]:
#method 1
df[df['Age']<40]['Survived'].value_counts()

0    322
1    229
Name: Survived, dtype: int64

In [56]:
#method 2
len(df[(df['Survived']==0) & (df['Age']<40)])

322

# In cabin column we have numeric and str try to split it

In [61]:
df['numeric_cabin']= df['Cabin'].str.replace('([a-zA-Z]+)','')
df['str_cabin']= df['Cabin'].str.extract('([a-zA-Z]+)')

C:\Users\Rengarajan\AppData\Local\Temp\ipykernel_17324\3997450058.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['numeric_cabin']= df['Cabin'].str.replace('([a-zA-Z]+)','')

In [62]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,New,numeric_cabin,str_cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,NaN,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,NaN,NaN